const Discord = require('discord.js');
const client = new Discord.Client();

const prefix="!"
client.on('ready', () => {
  console.log(`Logged in as ${client.user.tag}!`);
});

client.on("guildMemberAdd", member => {
  const channel = member.guild.channels.find(channel => channel.name === "welcome🖖");
  if(!channel) return;
  channel.send(`Welcome To **Elite RP**, ${member}`);
});


client.on('ready', () => {
    console.log('I am ready!');
  });
  
  // Create an event listener for messages
  client.on('message', message => {
    // If the message is "ping"
    if (message.content === 'ip') 
      // Send "pong" to the same channel
      message.channel.send("- How Connect To Server :"+"\n"+
      " "+"\n"+
      "-1- Open FiveM"+"\n"+
      "-2- Press F8"+"\n"+
      "-3- Copy this"+"\n"+
      " "+"\n"+
      "connect  31.214.245.72:32474"+"\n"+
      ""+"\n"+
      "-4- Press enter"+"\n"+
      "-5- Press F8"+"\n"+"")
    });
  
    client.on('ready', () => {
        console.log('I am ready!');
      });
      
      // Create an event listener for messages
      client.on('message', message => {
        // If the message is "ping"
        if (message.content === "وقت المقابلات") {
          // Send "pong" to the same channel
          message.channel.send("- من الساعه ٥ الي الساعه ٨");
        }
      });
      
      client.on('message', message => {
        // If the message is "ping"
        if (message.content === "مواعيد المقابلات") {
          // Send "pong" to the same channel
          message.channel.send("```- من الساعه ٥ الي الساعه ٨```");
        }
      });


        client.on('message', message => {
          // If the message is "ping"
          if (message.content === "0") {
            // Send "pong" to the same channel
            message.channel.send("https://cdn.discordapp.com/attachments/449382328079351818/592746146091368471/1158789.mp4")
          }
          });

          client.on('message', message => {
            // If the message is "ping"
            if (message.content === "1") {
              // Send "pong" to the same channel
              message.channel.send("```يجب ان تكون فوق سن ال 18 سنه```"+"\n"+
          
              "```يجب عليك تقدير حياتك وحياة الاخرين```"+"\n"+
              
              "```يجب عليك تقمص شخصيتك داخل السيرفر والتصرف بواقعية وعدم الخروج عن نطاق الرول بلاي تحت أي ظرف كان```"+"\n"+
              
              "```لازم تستخدم المايك و السماعه للتواصل مع من حولك```"+"\n"+
              
              "```RDM/VDM ممنوع ال```"+"\n"+
              
              "```لا يمكنك تغير اسمك فى البطاقه/الهويه الا بعد موافقه الاداره```"+"\n"+
              
              "```في حين كنت موظف في وظيفة رسمية ( مسعف - شرطي ) يمنع عليك العمل بأي عمل إجرامي من خطف او سرقة او قتل يجب عليك التحويل لمواطن وعمل ما شأت من الجرائم على حسب القوانين```"+"\n"+
              
              "```اذا قمت بتهديد شخص بسلاح و الشخص اذا لم يستجب في خلال 10 ثواني لك الحق في قتلة```"+"\n"+
              
              "```يمنع استخدام اي جلتش و  اخبار الإدارة به على الفور```"+"\n"+
              
              "```يمنع طلوع  الجبال بسيارات غير مخصصه لذلك```"+"\n"+
              
              "```يمنع تهديد المواطن اذا لم تكن تحمل سلاح```"+"\n"+
              
              "```يمنع الاعتداء على المفاوضين من الشرطة```"+"\n"+
              
              "```يمنع  سرقة أو تدمير أو أخذ ممتلكات الشرطة والإسعاف والميكانيكي```"+"\n"+
              
              "```يمنع منعاً باتاً استخدام او شراء ملابس الشرطة والإسعاف والميكانيكي```"+"\n"+
              
              "```يمنع ارتداء قناع او درع او التنكر تحت اى سبب من الاسباب الا فى حالات الاجرام```"+"\n"+
              
              "```يحق للمواطن المطالبة بحق عدم التفتيش إلا في حالة المرور على نقطة تفتيش او داخل قسم الشرطة أو يكون في قائمة المطلوبين أو في حالة التواجد في الأماكن المشبوهة في محيط إطلاق النار والمخدرات```"+"\n"+
              "```تسديد المخالفات و عدم تركهم (اكتر من 15 مخالفه)```"+"\n"+
              
              "```يمنع دخول الميناء الا بشاحنات العمل ... و الشرطه غير مسؤله عن اى جرائم بالداخل ما بين المجرمين و تجار المخدرات```"+"\n"+
              
              "```يمنع الخروج من السيرفر اذا كنت ملاحق من الشرطة او اثناء التحقيق مع الشرطة```"+"\n"+
              
              "```وفي حاله انقطاع  الاتصال بالمدينه يتوجب عليك الرجوع لقسم الشرطة مره اخري```"+"\n"+"")
            }
            });

            client.on('message', message => {
              // If the message is "ping"
              if (message.content === "20") {
                // Send "pong" to the same channel
                message.channel.send("```1- ان يكون ملتزم بنص القانون و معاملة المواطنين ساويا```"+"\n"+
                "```2- الحفاظ علي حياة المواطن و امن المدينة من اولويات عمله```"+"\n"+
                "```3- عدم الترصد لاى مواطن و اخذ المشاكل الشخصيا جانبا بعيدا عن عمله```"+"\n"+
                "```4- يجب اجتياز الدورة التدريبة كاملة```"+"\n"+
                "```5- الالتزام بالزى الرسمي و احترام القادة الاعلي رتبة منك و اطاعة اوامرهم```"+"\n"+
                "```6- التواجد في راديو الشرطة وعدم دخول اى راديو الا بعد الاذن من الرتبة الاعلي منك```"+"\n"+
                "```7- الحفاظ علي شرف الشرطة و طلب الدعم عند حدوث اى تجاوز```"+"\n"+
                "```8- يجب عمل تقرير مفصل عن كل جريمة تمت و الاحراز و العقوبات```"+"\n"+
                "```9- عهدتك متل شرفك لا يجب التفريط فيها لا سبب و الا عقوبة 80 شهر و حرمان من اى عمل في المدينة لفترة حسب التجاوز```"+"\n"+
                "```10- ان تكون جاهز بكل الادوات و الاسلحة في اى وقت لاى ظرف طارق```"+"\n"+
                "```11- بعد الاقالة او تقديم الاستقالة يتمم تسليم كل العهدة و يتم مراقبتك لفترة حتي يتاكد عدم تسريبك لاسرار الوظيفة```"+"\n"+
                "```12- ممنوع منع باتاً الهزار بالاسلحة مع زملاءك او مواطنين المدينة```"+"\n"+
                "```13- لك الحق في الكشف على بطاقة اى مواطن و الرخصة في حالة الشك فيه```"+"\n"+
                "```14- لك حق التدخل السريع في حالة وجود جريمة امامك و طلب الدعم الفورى```"+"\n"+
                "```15- عند الخيانة و الاتفاق مع اى مجرم لتهريبه او تقليص الغرامة او تهريب اى حرز معاقبة الخيانة الحبس و التغريم بمبلغ مليون و متين الف لخزينة الشرطة```"+"\n"+
                "```16- شخصيتك :الحزم _ الشهامة _الكرامة _ سرعة البديهة _الاخلاق الحميدة _الهمة و النشاط_عدم التلافظ بالالفاظ غير لاقة كشرطي```"+"\n"+
                "```17- طلب الاستفالة يتم تقديمه بما لا يقل عن 10 ايام من دخولك و الموافقة عليه لاسباب مقنعة```"+"\n"+
                "```18- قلب واحد وطن واحد التعاون و المحبة بيننا سوف نوقف اى جريمة في المدينة والله الوافق و المستعان```"+"\n"+"")
                
              }
            });
            client.on('message', message => {
              // If the message is "ping"
              if (message.content === "2") {
                // Send "pong" to the same channel
                message.channel.send("```:قوانين الميكانيكي```"+"\n"+

                "```1) اقل سن مقبول 18 سنة```"+"\n"+
                
                "```2) %مكسب الميكانيكي في البيعة 15```"+"\n"+
                
                "```3) يجب علي كل الميكانيكية أرتداء الزي الرسمي للعمل```"+"\n"+
                
                "```4) يجب ان يكون متواجد 4-6 ساعات علي الاقل في المدينة```"+"\n"+
                
                "```5) ممنوع تفيم السيارات الا للشرطة و اقل رتبة مسموحة ملازم أول و الوزراء```"+"\n"+
                
                "```6) عدد السيارات المتواجدة في الورشة لا يزيد عن 2```"+"\n"+
                
                "```7) ممنوع منعا باتا تعديل اي سيارة بدون رخصة تعديل```"+"\n"+
                
                "```8) ممنوع وضع اى كلاكس الشرطه علي اي سياره مواطن```"+"\n"+
                
                "```9) عدم التدخل او الاندماج في اي سيانريو خارج عملك كميكانيكي في حالة وجودك داخل الخدمه```"+"\n"+
                
                "```10) يمنع طلب الترقيه الترقيه علي حسب نشاطك في الورشه وراي ادارة الورشه بك```"+"\n"+
                
                "```11) لاعدم الاختلاس باي شكل من الورشه او التعديل تحت الاسعار المحدده من الادارة الخاصه بالورشه لاي شخص مهما كان (الا وزاره الداخليه )دول حبايبنه```"+"\n"+
                
                "```12) لضمان المكافئات ينصح التقاط صورة لكل الفواتير المدفوعة```"+"\n"+
                
                "```13) اول 3 ايام من التعيين سيكون تدريب للعمل```"+"\n"+
                
                "```14) ممنوع الاشتراك في اي اعمال اجرامية بدون اذن من وزير الصناعة```"+"\n"+
                
                "```15) يجب تسجيل اوقات الدخول و الخروج في دقتر الحضور```"+"\n"+
                
                "```16) اذا ساعد الميكانيكي في فعالية سيكون له مكافئة```"+"\n"+
                
                "```@here```"+"\n"+"")
              }
              });

                

          client.on('message', message => {
            // If the message is "ping"
            if (message.content === "السلام عليكم") {
              // Send "pong" to the same channel
              message.channel.send("وعليكم السلام")
    
            }
            });

            client.on('message', msg => {
              if (msg.content === 'سرقه البقاله') 
                msg.reply("-1-اقصى عدد لأفراد العصابة في سرقه البقالة هو 3 اشخاص"+"\n"+
                "-2-يجب على جميع افراد العصابة التواجد داخل البقالة"+"\n"+
                "-3-يجب ارتداء ملابس العصابة الموحدة لجميع افراد العصابة اثناء السرقة"+"\n"+
                "-4-مسموح بتواجد رهينه واحده كحد اقصى"+"\n"+
                "-5-لا يسمح بأخذ رهينة من نفس العصابة"+"\n"+
                "-6-الحد الأقصى لطلب فدية لتحرير رهينة واحدة في سرقه البقالة(سوبر ماركت) 30.000$ للمواطن و 35.000$ للشرطي"+"\n"+"")
            
            });
            
        
         client.on('message', msg => {
        if (msg.content === 'قوانين العصابات') 
          msg.reply("-1-اقصى عدد لافراد العصابه هم 5 اشخاص"+"\n"+
          "-2-يجب على جميع افراد العصابه ارتداء ملابس موحده (نفس الون) ولا يمكنك تغيرهم تحت اى ظرف"+"\n"+
          "-3-يمنع على العصابات استخدام لبس/عربيات عصابه اخرى"+"\n"+
          "-4-(يمنع الاعتداء على المواطنين, افراد عصابات اخرى, او الشرطه الا فى حالات معينه (امثلة: خطف, سرقه بنك, او سرقه بقاله"+"\n"+
          "-5-يمنع التعاون بين العصابات و بعضها ضد عصابات اخرى او الشرطه"+"\n"+"")
        
          });
         
          client.on('message', msg => {
            if (msg.content === 'قوانين سرقه على البنك') 
              msg.reply("-1-اقصى عدد لافراد العصابه فى سرقه البنك هو 5 اشخاص"+"\n"+
              "-2-يجب على جميع افراد العصابه التواجد داخل البنك"+"\n"+
              "-3-يجب ارتداء ملابس العصابه الموحده لجميع افراد العصابه اثناء السرقه"+"\n"+
              "-4-مسموح بتواجد ثلاثه رهائن كحد اقصى"+"\n"+
              "-5-لا يسمح بأخذ رهينة من نفس العصابة"+"\n"+
              "-6-الحد الأقصى لطلب فدية لتحرير رهينة واحدة فى سرقه البنك 120.000$ للمواطن و 150.000$ للشرطى"+"\n"+
              "-7-اقل عدد لإفراد العصابة ثلاثة"+"\n"+"")
        
              });


            client.on('message', msg => {
              if (msg.content === ' سرقه البنك') 
                msg.reply("-1-اقصى عدد لافراد العصابه فى سرقه البنك هو 5 اشخاص"+"\n"+
                "-2-يجب على جميع افراد العصابه التواجد داخل البنك"+"\n"+
                "-3-يجب ارتداء ملابس العصابه الموحده لجميع افراد العصابه اثناء السرقه"+"\n"+
                "-4-مسموح بتواجد ثلاثه رهائن كحد اقصى"+"\n"+
                "-5-لا يسمح بأخذ رهينة من نفس العصابة"+"\n"+
                "-6-الحد الأقصى لطلب فدية لتحرير رهينة واحدة فى سرقه البنك 120.000$ للمواطن و 150.000$ للشرطى"+"\n"+
                "-7-اقل عدد لإفراد العصابة ثلاثة"+"\n"+"")
          
                });
          
                client.on('message', msg => {
                  if (msg.content === 'سرقه  يخت-') 
                   msg.reply("-1-اقصى عدد لأفراد العصابة في سرقه  هو 4 اشخاص"+"\n"+
                   "-2-يجب على جميع افراد العصابة التواجد داخل اليخت"+"\n"+
                   "-3-يجب ارتداء ملابس العصابة الموحدة لجميع افراد العصابة اثناء السرق"+"\n"+
                   "-4-مسموح بتواجد ثلاثة رهائن كحد اقصى"+"\n"+
                   "-5-لا يسمح بأخذ رهينة من نفس العصابة"+"\n"+
                   "-6-الحد الأقصى لطلب فدية لتحرير رهينة واحدة في 50.000$ للمواطن و 75.000$ للشرطي"+"\n"+
                   "-7-يمنع الهروب بغواصه"+"\n"+
                   "-8-يمكن لأفراد العصابة الهروب سباحه او طلب قارب بوجود رهينه او طياره حسب المفوض"+"\n"+
                   "-9-اقل عدد لإفراد العصابة ثلاثة"+"\n"+"")
                });
                   
          
          
          
          client.on('message', msg => {
          if (msg.content === 'سرقه محل المجوهرات') 
           msg.reply("-1-اقصى عدد لافراد العصابه فى سرقه محل المجوهرات هو 4 اشخاص"+"\n"+
           "-2-يجب على جميع افراد العصابه التواجد داخل محل المجوهرات"+"\n"+
           "-3-يجب ارتداء ملابس العصابه الموحده لجميع افراد العصابه اثناء السرقه"+"\n"+
           "-4-مسموح بتواجد ثلاثه رهائن كحد اقصى"+"\n"+
           "-5-لا يسمح بأخذ رهينة من نفس العصابة"+"\n"+
           "-6-الحد الأقصى لطلب فدية لتحرير رهينة واحدة فى سرقه محل المجوهرات 30.000$ للمواطن و 50.000$ للشرطى"+"\n"+
           "-7-اقل عدد لإفراد العصابة ثلاثة"+"\n"+"")
          });
          
          
            client.on('message', msg => {
              if (msg.content === 'سرقه المصنع') 
               msg.reply( "خاج المدينه"+"\n"+
               "-1-اقصى عدد لأفراد العصابة في السرقة هو 5 اشخاص"+"\n"+
               "-2-اقل عدد لإفراد العصابة ثلاثة"+"\n"+
               "-3-يجب على جميع افراد العصابة التواجد داخل المصنع"+"\n"+
               "-4-يجب ارتداء ملابس العصابة الموحدة لجميع افراد العصابة اثناء السرق"+"\n"+
               "-5-مسموح بتواجد ثلاثة رهائن كحد اقصى"+"\n"+
               "-6-لا يسمح بأخذ رهينة من نفس العصابة"+"\n"+
               "-7-الحد الأقصى لطلب فدية لتحرير رهينة واحدة فى سرقه المصنع 50.000 للمواطن و 100.000$ للشرطى"+"\n"+
               "-8-يمنع الهروب بغواصه"+"\n"+
               "-9-يمكن لأفراد العصابة الهروب سباحه او طلب قارب بوجود رهينه او طياره حسب المفوض"+"\n"+"")
            });
          


            client.on('message', message => {
              // If the message is "what is my avatar"
              if (message.content === 'خلفيه الموبيل') {
                // Send the user's avatar URL
                message.reply("https://media.discordapp.net/attachments/615311030599417866/627884597773860885/EliteRP.png?width=284&height=504");
 }
 });

 client.on('ready', () => {
  console.log('I am ready!');
});

client.on('ready', () => {
  console.log('I am ready!');
});

client.on('ready', () => {
  console.log('I am ready!');
});




  client.login("NjI3NTQ4NDkxOTMzMDI0MjY2.XY-g8A._hqlTtzbt6yF-ylYtRJSESQ63xw");